---
kind: method
id: M:Autodesk.Revit.DB.SharedParameterElement.ShouldHideWhenNoValue
source: html/c9cfaeab-a393-e255-fa8e-418afdc6f6c5.htm
---
# Autodesk.Revit.DB.SharedParameterElement.ShouldHideWhenNoValue Method

Indicates whether the parameter should be hidden from the properties palette if it has no value.

## Syntax (C#)
```csharp
public bool ShouldHideWhenNoValue()
```